app/controllers/students_controller.rb

  def new
    @student = Student.new
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("created_at", "updated_at", "school_id") VALUES (?, ?, ?)  [["created_at", "2019-06-10 15:59:35.086621"], ["updated_at", "2019-06-10 15:59:35.086621"], ["school_id", 1]]

  def delete
    @student = Student.find(params[:id])
    @school = @student.school
    @student.delete
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]

  def edit
    @student = Student.find(params[:id])
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_id", 5], ["updated_at", "2019-06-10 17:17:43.174120"], ["id", 4]]